Pipe Flow Validation/Linux Files/cases/kOmegaSST_Re5000/0/k
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      k;
}

dimensions      [0 2 -2 0 0 0 0];

// k = 1.5*(I*U)^2, I=0.05. Placeholder — overwritten per case.
internalField   uniform 8.4375e-03;

boundaryField
{
    inlet   { type cyclic; }
    outlet  { type cyclic; }
    wall
    {
        type            kLowReWallFunction;
        value           uniform 8.4375e-03;
    }
    front   { type wedge; }
    back    { type wedge; }
    axis    { type empty; }
}
