Pipe Flow Validation/Linux Files/cases/kOmegaSST_Re5000/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  Axisymmetric wedge: D=0.05 m, L=0.25 m, 5-degree wedge (±2.5°)
  Axis = z, radial = x, wedge planes = xz rotated ±2.5° about z
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

scale   1;

// R = 0.025 m, half-angle = 2.5 deg
// R * sin(2.5°) = 0.025 * 0.043619 = 0.0010905
// Axial length L = 0.25 m (= 5 D)

vertices
(
    ( 0       0           0    )  // 0  axis  z=0
    ( 0.025  -0.0010905   0    )  // 1  outer z=0 -side
    ( 0.025   0.0010905   0    )  // 2  outer z=0 +side
    ( 0       0           0.25 )  // 3  axis  z=L
    ( 0.025  -0.0010905   0.25 )  // 4  outer z=L -side
    ( 0.025   0.0010905   0.25 )  // 5  outer z=L +side
);

blocks
(
    // (0 1 2 0 3 4 5 3): wedge collapsed at axis
    // i = radial (axis→wall), j = circumferential (collapsed), k = axial
    // cells: (nr=25, ntheta=1, nz=50)
    // radial grading 0.1 = last/first → smaller cells at wall
    hex (0 1 2 0 3 4 5 3) (25 1 50) simpleGrading (0.1 1 1)
);

edges
(
);

boundary
(
    inlet
    {
        type        cyclic;
        neighbourPatch outlet;
        faces       ( (0 1 2 0) );
    }
    outlet
    {
        type        cyclic;
        neighbourPatch inlet;
        faces       ( (3 4 5 3) );
    }
    wall
    {
        type        wall;
        faces       ( (1 4 5 2) );
    }
    front
    {
        type        wedge;
        faces       ( (0 3 4 1) );
    }
    back
    {
        type        wedge;
        faces       ( (0 2 5 3) );
    }
    axis
    {
        type        empty;
        faces       ( (0 3 3 0) );
    }
);
